Repository: sgavka/mystic_bots
Catalog: locale/*/LC_MESSAGES/django.po
Languages: hi, ru, uk

source: 😔 Sorry, I couldn't generate an answer right now. Please try again later.
hi: 😔 क्षमा करें, मैं अभी उत्तर नहीं बना सका। कृपया बाद में पुनः प्रयास करें।
ru: 😔 Извините, не удалось сгенерировать ответ сейчас. Попробуйте позже.
uk: 😔 Вибачте, не вдалося згенерувати відповідь зараз. Спробуйте пізніше.

source: ⚠️ You haven't set up your profile yet. Send /start to begin the onboarding wizard.
hi: ⚠️ आपने अभी तक अपनी प्रोफ़ाइल सेट नहीं की है। सेटअप शुरू करने के लिए /start भेजें।
ru: ⚠️ Вы ещё не настроили свой профиль. Отправьте /start для начала настройки.
uk: ⚠️ Ви ще не налаштували свій профіль. Надішліть /start для початку налаштування.

source: 🔮 Your horoscope is being generated right now! Please check back in a minute.
hi: 🔮 आपका राशिफल अभी बनाया जा रहा है! कृपया एक मिनट में जाँचें।
ru: 🔮 Ваш гороскоп генерируется прямо сейчас! Пожалуйста, проверьте через минуту.
uk: 🔮 Ваш гороскоп зараз генерується! Будь ласка, перевірте через хвилину.

source: ⏳ Your horoscope for today is not ready yet. It will be generated soon. Please check back later.
hi: ⏳ आज का आपका राशिफल अभी तैयार नहीं है। यह जल्द ही बनाया जाएगा। कृपया बाद में जाँचें।
ru: ⏳ Ваш гороскоп на сегодня ещё не готов. Он скоро будет сгенерирован. Проверьте позже.
uk: ⏳ Ваш гороскоп на сьогодні ще не готовий. Він скоро буде згенерований. Перевірте пізніше.

source: 💬 You can ask questions about your horoscope — just type your message!
hi: 💬 आप अपने राशिफल के बारे में प्रश्न पूछ सकते हैं — बस अपना संदेश लिखें!
ru: 💬 Вы можете задавать вопросы о своём гороскопе — просто напишите сообщение!
uk: 💬 Ви можете задавати питання про свій гороскоп — просто напишіть повідомлення!

source: 🔒 Subscribe to see your full daily horoscope!
hi: 🔒 अपना पूरा दैनिक राशिफल देखने के लिए सदस्यता लें!
ru: 🔒 Подпишитесь, чтобы видеть полный ежедневный гороскоп!
uk: 🔒 Підпишіться, щоб бачити повний щоденний гороскоп!

source: 🌍 Your current language: <b>{lang_name}</b> Choose a new language:
hi: 🌍 आपकी वर्तमान भाषा: <b>{lang_name}</b> नई भाषा चुनें:
ru: 🌍 Ваш текущий язык: <b>{lang_name}</b> Выберите новый язык:
uk: 🌍 Ваша поточна мова: <b>{lang_name}</b> Оберіть нову мову:

source: ✅ Language changed to <b>English</b> 🇬🇧
hi: ✅ भाषा <b>हिन्दी</b> 🇮🇳 में बदली गई
ru: ✅ Язык изменён на <b>Русский</b> 🇷🇺
uk: ✅ Мову змінено на <b>Українська</b> 🇺🇦

source: ⚠️ You haven't set up your profile yet. Send /start to begin.
hi: ⚠️ आपने अभी तक प्रोफ़ाइल सेट नहीं की है। शुरू करने के लिए /start भेजें।
ru: ⚠️ Вы ещё не настроили профиль. Отправьте /start для начала.
uk: ⚠️ Ви ще не налаштували профіль. Надішліть /start для початку.

source: ⭐ Subscribe for <b>{days} days</b> of full daily horoscope access. 💰 Price: <b>{price} Telegram Stars</b> Tap the button below to pay.
hi: ⭐ <b>{days} दिनों</b> के पूर्ण दैनिक राशिफल एक्सेस के लिए सदस्यता लें। 💰 मूल्य: <b>{price} Telegram Stars</b> भुगतान करने के लिए नीचे बटन दबाएँ।
ru: ⭐ Подпишитесь на <b>{days} дней</b> полного доступа к ежедневному гороскопу. 💰 Цена: <b>{price} Telegram Stars</b> Нажмите кнопку ниже для оплаты.
uk: ⭐ Підпишіться на <b>{days} днів</b> повного доступу до щоденного гороскопу. 💰 Ціна: <b>{price} Telegram Stars</b> Натисніть кнопку нижче для оплати.

source: ✅ You already have an active subscription. 📅 Expires: <b>{expires}</b> You can renew now — the new period will start from your current expiration date. 💰 Price: <b>{price} Telegram Stars</b> for <b>{days} days</b> Tap the button below to extend.
hi: ✅ आपकी पहले से एक सक्रिय सदस्यता है। 📅 समाप्ति: <b>{expires}</b> आप अभी नवीनीकरण कर सकते हैं — नई अवधि आपकी वर्तमान समाप्ति तिथि से शुरू होगी। 💰 कीमत: <b>{days} दिनों</b> के लिए <b>{price} Telegram Stars</b> विस्तार करने के लिए नीचे बटन दबाएँ।
ru: ✅ У вас уже есть активная подписка. 📅 Действует до: <b>{expires}</b> Вы можете продлить сейчас — новый период начнётся с даты окончания текущей подписки. 💰 Цена: <b>{price} Telegram Stars</b> за <b>{days} дней</b> Нажмите кнопку ниже для продления.
uk: ✅ У вас вже є активна підписка. 📅 Діє до: <b>{expires}</b> Ви можете продовжити зараз — новий період почнеться з дати закінчення поточної підписки. 💰 Ціна: <b>{price} Telegram Stars</b> за <b>{days} днів</b> Натисніть кнопку нижче для продовження.

source: Horoscope Subscription
hi: राशिफल सदस्यता
ru: Подписка на гороскоп
uk: Підписка на гороскоп

source: {days}-day access to full daily horoscope
hi: पूर्ण दैनिक राशिफल तक {days} दिनों की पहुँच
ru: Доступ к полному ежедневному гороскопу на {days} дней
uk: Доступ до повного щоденного гороскопу на {days} днів

source: ✅ Payment successful! Your subscription is now active. 📅 Expires: {expires} Use /horoscope to see your full daily horoscope ✨
hi: ✅ भुगतान सफल! आपकी सदस्यता अब सक्रिय है। 📅 समाप्ति: {expires} अपना पूरा दैनिक राशिफल देखने के लिए /horoscope का उपयोग करें ✨
ru: ✅ Оплата прошла успешно! Ваша подписка активирована. 📅 Действует до: {expires} Используйте /horoscope для просмотра полного гороскопа ✨
uk: ✅ Оплата пройшла успішно! Вашу підписку активовано. 📅 Дійсна до: {expires} Використовуйте /horoscope для перегляду повного гороскопу ✨

source: 😔 Something went wrong while activating your subscription. Please contact support if the issue persists.
hi: 😔 सदस्यता सक्रिय करते समय कुछ गलत हो गया। यदि समस्या बनी रहे तो कृपया सहायता से संपर्क करें।
ru: 😔 Что-то пошло не так при активации подписки. Пожалуйста, обратитесь в поддержку, если проблема сохранится.
uk: 😔 Щось пішло не так при активації підписки. Будь ласка, зверніться до підтримки, якщо проблема залишиться.

source: 🌍 Please choose your language:
hi: 🌍 कृपया अपनी भाषा चुनें:
ru: 🌍 Пожалуйста, выберите язык:
uk: 🌍 Будь ласка, оберіть мову:

source: 👋 Welcome back, <b>{name}</b>! Your profile is already set up. You'll receive your daily horoscope soon ✨
hi: 👋 वापसी पर स्वागत है, <b>{name}</b>! आपकी प्रोफ़ाइल पहले से तैयार है। आपको जल्द ही दैनिक राशिफल मिलेगा ✨
ru: 👋 С возвращением, <b>{name}</b>! Ваш профиль уже настроен. Скоро вы получите ежедневный гороскоп ✨
uk: 👋 З поверненням, <b>{name}</b>! Ваш профіль вже налаштований. Скоро ви отримаєте щоденний гороскоп ✨

source: ✨ Welcome to <b>Mystic Horoscope</b>! ✨ 🔮 I'll create a personalized horoscope just for you. Let's set up your profile first. What is your <b>name</b>?
hi: ✨ <b>Mystic Horoscope</b> में आपका स्वागत है! ✨ 🔮 मैं आपके लिए व्यक्तिगत राशिफल बनाऊँगा। पहले अपनी प्रोफ़ाइल सेट करें। आपका <b>नाम</b> क्या है?
ru: ✨ Добро пожаловать в <b>Mystic Horoscope</b>! ✨ 🔮 Я создам персональный гороскоп специально для вас. Давайте сначала настроим профиль. Как вас <b>зовут</b>?
uk: ✨ Ласкаво просимо до <b>Mystic Horoscope</b>! ✨ 🔮 Я створю персональний гороскоп спеціально для вас. Спочатку налаштуємо профіль. Як вас <b>звати</b>?

source: Please enter a valid name (2-100 characters).
hi: कृपया एक मान्य नाम दर्ज करें (2-100 अक्षर)।
ru: Пожалуйста, введите корректное имя (2-100 символов).
uk: Будь ласка, введіть коректне ім'я (2-100 символів).

source: 😊 Nice to meet you, <b>{name}</b>! 📅 Now, please enter your <b>full date of birth</b>. Example: <code>15.03.1990</code>
hi: 😊 आपसे मिलकर अच्छा लगा, <b>{name}</b>! 📅 अब कृपया अपनी <b>पूरी जन्म तिथि</b> दर्ज करें। उदाहरण: <code>15.03.1990</code>
ru: 😊 Приятно познакомиться, <b>{name}</b>! 📅 Теперь введите вашу <b>полную дату рождения</b>. Пример: <code>15.03.1990</code>
uk: 😊 Приємно познайомитися, <b>{name}</b>! 📅 Тепер введіть вашу <b>повну дату народження</b>. Приклад: <code>15.03.1990</code>

source: Invalid date format. Accepted formats: <code>DD.MM.YYYY</code>, <code>DD/MM/YYYY</code>, <code>DD-MM-YYYY</code>, <code>YYYY-MM-DD</code> Example: <code>15.03.1990</code>
hi: अमान्य तिथि प्रारूप। स्वीकृत प्रारूप: <code>DD.MM.YYYY</code>, <code>DD/MM/YYYY</code>, <code>DD-MM-YYYY</code>, <code>YYYY-MM-DD</code> उदाहरण: <code>15.03.1990</code>
ru: Неверный формат даты. Допустимые форматы: <code>ДД.ММ.ГГГГ</code>, <code>ДД/ММ/ГГГГ</code>, <code>ДД-ММ-ГГГГ</code>, <code>ГГГГ-ММ-ДД</code> Пример: <code>15.03.1990</code>
uk: Невірний формат дати. Допустимі формати: <code>ДД.ММ.РРРР</code>, <code>ДД/ММ/РРРР</code>, <code>ДД-ММ-РРРР</code>, <code>РРРР-ММ-ДД</code> Приклад: <code>15.03.1990</code>

source: Date of birth must be in the past. Please try again.
hi: जन्म तिथि अतीत में होनी चाहिए। कृपया पुनः प्रयास करें।
ru: Дата рождения должна быть в прошлом. Попробуйте ещё раз.
uk: Дата народження має бути в минулому. Спробуйте ще раз.

source: Please enter a valid date of birth.
hi: कृपया एक मान्य जन्म तिथि दर्ज करें।
ru: Пожалуйста, введите корректную дату рождения.
uk: Будь ласка, введіть коректну дату народження.

source: 🕐 Do you know your <b>birth time</b>? It helps make the horoscope more precise. Enter time in format <code>HH:MM</code> (e.g. <code>14:30</code>), or press the button below to skip.
hi: 🕐 क्या आप अपना <b>जन्म समय</b> जानते हैं? यह राशिफल को अधिक सटीक बनाने में मदद करता है। समय <code>HH:MM</code> प्रारूप में दर्ज करें (जैसे <code>14:30</code>), या छोड़ने के लिए नीचे बटन दबाएँ।
ru: 🕐 Знаете ли вы <b>время рождения</b>? Это поможет сделать гороскоп точнее. Введите время в формате <code>ЧЧ:ММ</code> (например <code>14:30</code>), или нажмите кнопку ниже, чтобы пропустить.
uk: 🕐 Чи знаєте ви <b>час народження</b>? Це допоможе зробити гороскоп точнішим. Введіть час у форматі <code>ГГ:ХХ</code> (наприклад <code>14:30</code>), або натисніть кнопку нижче, щоб пропустити.

source: Invalid time format. Please enter time as <code>HH:MM</code> (e.g. <code>14:30</code>), or press the button below to skip.
hi: अमान्य समय प्रारूप। कृपया समय <code>HH:MM</code> के रूप में दर्ज करें (जैसे <code>14:30</code>), या छोड़ने के लिए नीचे बटन दबाएँ।
ru: Неверный формат времени. Введите время как <code>ЧЧ:ММ</code> (например <code>14:30</code>), или нажмите кнопку ниже, чтобы пропустить.
uk: Невірний формат часу. Введіть час як <code>ГГ:ХХ</code> (наприклад <code>14:30</code>), або натисніть кнопку нижче, щоб пропустити.

source: 🎯 Great! Now, please enter your <b>place of birth</b> (city). Example: <code>London</code>
hi: 🎯 बहुत अच्छा! अब कृपया अपना <b>जन्म स्थान</b> (शहर) दर्ज करें। उदाहरण: <code>मुंबई</code>
ru: 🎯 Отлично! Теперь введите ваше <b>место рождения</b> (город). Пример: <code>Москва</code>
uk: 🎯 Чудово! Тепер введіть ваше <b>місце народження</b> (місто). Приклад: <code>Київ</code>

source: Please enter a valid city name (2-200 characters).
hi: कृपया एक मान्य शहर का नाम दर्ज करें (2-200 अक्षर)।
ru: Пожалуйста, введите корректное название города (2-200 символов).
uk: Будь ласка, введіть коректну назву міста (2-200 символів).

source: 📍 Almost done! Please enter your <b>current place of living</b> (city). Example: <code>New York</code>
hi: 📍 लगभग हो गया! कृपया अपना <b>वर्तमान निवास स्थान</b> (शहर) दर्ज करें। उदाहरण: <code>दिल्ली</code>
ru: 📍 Почти готово! Введите ваше <b>текущее место проживания</b> (город). Пример: <code>Санкт-Петербург</code>
uk: 📍 Майже готово! Введіть ваше <b>поточне місце проживання</b> (місто). Приклад: <code>Львів</code>

source: ✅ Your profile is ready, <b>{name}</b>! 📅 Date of birth: {dob} {birth_time_line}🏠 Born in: {place_of_birth} 📍 Living in: {place_of_living} 🔮 Generating your first horoscope... Please wait a moment.
hi: ✅ आपकी प्रोफ़ाइल तैयार है, <b>{name}</b>! 📅 जन्म तिथि: {dob} {birth_time_line}🏠 जन्म स्थान: {place_of_birth} 📍 निवास स्थान: {place_of_living} 🔮 आपका पहला राशिफल बनाया जा रहा है... कृपया प्रतीक्षा करें।
ru: ✅ Ваш профиль готов, <b>{name}</b>! 📅 Дата рождения: {dob} {birth_time_line}🏠 Место рождения: {place_of_birth} 📍 Место проживания: {place_of_living} 🔮 Генерирую ваш первый гороскоп... Пожалуйста, подождите.
uk: ✅ Ваш профіль готовий, <b>{name}</b>! 📅 Дата народження: {dob} {birth_time_line}🏠 Місце народження: {place_of_birth} 📍 Місце проживання: {place_of_living} 🔮 Генерую ваш перший гороскоп... Будь ласка, зачекайте.

source: 🕐 Birth time: {birth_time}
hi: 🕐 जन्म समय: {birth_time}
ru: 🕐 Время рождения: {birth_time}
uk: 🕐 Час народження: {birth_time}

source: 😔 Something went wrong while creating your profile. Please try again with /start
hi: 😔 प्रोफ़ाइल बनाते समय कुछ गलत हो गया। कृपया /start से पुनः प्रयास करें
ru: 😔 Что-то пошло не так при создании профиля. Попробуйте снова с /start
uk: 😔 Щось пішло не так при створенні профілю. Спробуйте знову з /start

source: ⭐ Subscribe for full horoscope
hi: ⭐ पूर्ण राशिफल के लिए सदस्यता लें
ru: ⭐ Подписаться на полный гороскоп
uk: ⭐ Підписатися на повний гороскоп

source: ⏭ Skip
hi: ⏭ छोड़ें
ru: ⏭ Пропустить
uk: ⏭ Пропустити

source: 🔮 Your first horoscope is ready! {text}
hi: 🔮 आपका पहला राशिफल तैयार है! {text}
ru: 🔮 Ваш первый гороскоп готов! {text}
uk: 🔮 Ваш перший гороскоп готовий! {text}

source: ⏰ Your horoscope subscription expires in <b>{days} day(s)</b>. Renew now to keep receiving your full daily horoscope! ✨ Use /subscribe to renew.
hi: ⏰ आपकी राशिफल सदस्यता <b>{days} दिन(ों)</b> में समाप्त हो रही है। अपना पूरा दैनिक राशिफल प्राप्त करते रहने के लिए अभी नवीनीकरण करें! ✨ नवीनीकरण के लिए /subscribe का उपयोग करें।
ru: ⏰ Ваша подписка на гороскоп истекает через <b>{days} дн.</b> Продлите сейчас, чтобы продолжить получать полный ежедневный гороскоп! ✨ Используйте /subscribe для продления.
uk: ⏰ Ваша підписка на гороскоп закінчується через <b>{days} дн.</b> Поновіть зараз, щоб продовжити отримувати повний щоденний гороскоп! ✨ Використовуйте /subscribe для продовження.

source: ⚠️ Your horoscope subscription has <b>expired</b>. You'll now see a preview of your daily horoscope. Subscribe again to get full access! ⭐ Use /subscribe to subscribe again.
hi: ⚠️ आपकी राशिफल सदस्यता <b>समाप्त</b> हो गई है। अब आप अपने दैनिक राशिफल का पूर्वावलोकन देखेंगे। पूर्ण पहुँच के लिए फिर से सदस्यता लें! ⭐ फिर से सदस्यता लेने के लिए /subscribe का उपयोग करें।
ru: ⚠️ Ваша подписка на гороскоп <b>истекла</b>. Теперь вы видите только превью гороскопа. Подпишитесь снова для полного доступа! ⭐ Используйте /subscribe для повторной подписки.
uk: ⚠️ Ваша підписка на гороскоп <b>закінчилася</b>. Тепер ви бачите лише попередній перегляд гороскопу. Підпишіться знову для повного доступу! ⭐ Використовуйте /subscribe для повторної підписки.
